; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v5 - type_2 ?v2 - type_3)
 	      (pred_4 ?v8 - object ?v2 - type_3)
	      (pred_1 ?v5 - type_2 ?v3 - type_1)
	      (pred_3 ?v5 - type_2 ?v8 - object ?v3 - type_1))

   (:action op_3
       :parameters  (?v5 - type_2 ?v6 ?v1 - type_3)
       :precondition (and  (pred_2 ?v5 ?v6))
       :effect (and  (pred_2 ?v5 ?v1)
		     (not (pred_2 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_2 ?v7 - object ?v4 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v4) (pred_2 ?v5 ?v4) (pred_1 ?v5 ?v3))
       :effect (and (pred_3 ?v5 ?v7 ?v3)
		    (not (pred_4 ?v7 ?v4)) 
		    (not (pred_1 ?v5 ?v3))))

   (:action op_1
       :parameters (?v5 - type_2 ?v7 - object ?v4 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v7 ?v3) (pred_2 ?v5 ?v4))
       :effect (and (pred_4 ?v7 ?v4)
		    (pred_1 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v7 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_05 obj_07 - type_1
obj_01 obj_06 obj_03 - type_3
obj_02 obj_08 obj_04 - object)
(:init
(pred_2 obj_09 obj_06)
(pred_1 obj_09 obj_05)
(pred_1 obj_09 obj_07)
(pred_4 obj_02 obj_01)
(pred_4 obj_08 obj_01)
(pred_4 obj_04 obj_06)
)
(:goal
(and
(pred_4 obj_02 obj_03)
(pred_4 obj_08 obj_06)
(pred_4 obj_04 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_09 ?b obj_07))))
)
)

; plan
1. (op_2 obj_09 obj_04 obj_06 obj_05)
   deleted: (pred_4 obj_04 obj_06) (pred_1 obj_09 obj_05)
   added: (pred_3 obj_09 obj_04 obj_05)
   goals met: 0 of 3
2. (op_3 obj_09 obj_06 obj_01)
   deleted: (pred_2 obj_09 obj_06)
   added: (pred_2 obj_09 obj_01)
   goals met: 0 of 3
3. (op_1 obj_09 obj_04 obj_01 obj_05)
   deleted: (pred_3 obj_09 obj_04 obj_05)
   added: (pred_4 obj_04 obj_01) (pred_1 obj_09 obj_05)
   goals met: 1 of 3
4. (op_2 obj_09 obj_02 obj_01 obj_05)
   deleted: (pred_4 obj_02 obj_01) (pred_1 obj_09 obj_05)
   added: (pred_3 obj_09 obj_02 obj_05)
   goals met: 1 of 3
5. (op_3 obj_09 obj_01 obj_03)
   deleted: (pred_2 obj_09 obj_01)
   added: (pred_2 obj_09 obj_03)
   goals met: 1 of 3
6. (op_1 obj_09 obj_02 obj_03 obj_05)
   deleted: (pred_3 obj_09 obj_02 obj_05)
   added: (pred_4 obj_02 obj_03) (pred_1 obj_09 obj_05)
   goals met: 2 of 3
7. (op_3 obj_09 obj_03 obj_01)
   deleted: (pred_2 obj_09 obj_03)
   added: (pred_2 obj_09 obj_01)
   goals met: 2 of 3
8. (op_2 obj_09 obj_08 obj_01 obj_05)
   deleted: (pred_4 obj_08 obj_01) (pred_1 obj_09 obj_05)
   added: (pred_3 obj_09 obj_08 obj_05)
   goals met: 2 of 3
9. (op_3 obj_09 obj_01 obj_06)
   deleted: (pred_2 obj_09 obj_01)
   added: (pred_2 obj_09 obj_06)
   goals met: 2 of 3
10. (op_1 obj_09 obj_08 obj_06 obj_05)
   deleted: (pred_3 obj_09 obj_08 obj_05)
   added: (pred_4 obj_08 obj_06) (pred_1 obj_09 obj_05)
   goals met: 3 of 3
